exercises/exercise_06_Klausurvorbereitung.tex
% Created 2025-12-31 Mi 14:03
% Intended LaTeX compiler: xelatex
\documentclass[a4paper,14pt,ngerman]{scrartcl}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{polyglossia}
\usepackage{polyglossia}
\setmainlanguage[variant=german]{german}
\usepackage{polyglossia}
\setdefaultlanguage{german}
\PolyglossiaSetup{german}{shorthands=on}
\AtBeginDocument{\let\babelprovide\relax}
\AtBeginDocument{\let\shorthandon\relax}
\AtBeginDocument{\let\shorthandoff\relax}
\setmainfont{Gentium Book Basic}
\setsansfont{Latin Modern Sans}
\setmonofont{Latin Modern Mono}
\usepackage{fancyhdr}
\usepackage{graphicx}
\usepackage{amsmath,amssymb}
\usepackage{xcolor}
\usepackage{xurl}
\usepackage{listings}
\usepackage{setspace}
\setstretch{1.3}
\author{Elias}
\date{\today}
\title{Übungsblatt 6}
\hypersetup{
 pdfauthor={Elias},
 pdftitle={Übungsblatt 6},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={German}}
\begin{document}

\section{\textbf{Übung 6}}
\label{sec:org2fa2606}
\subsection{\textbf{Klausurvorbereitung}}
\label{sec:org8f5cbdd}

\subsubsection{\textbf{Aufgabe 1}}
\label{sec:orge482dd6}

Zeigen Sie mittels Resolution, dass die Formel
\[F=(\neg P \land \neg Q \land R) \lor (\neg P \land \neg R) \lor (Q \land R) \lor P\]
eine Tautologie ist.
\subsubsection{\textbf{Aufgabe 2}}
\label{sec:org47e9d95}

\begin{enumerate}
\item Konstruieren Sie einen DFA, der die Wörter über \(\Sigma=\{0,1\}\)
akzeptiert, die die Zeichenfolge 11010 enthalten.

\item Konstruieren Sie einen DFA, der folgende Sprache akzeptiert:
\[L=\{w \in \{a,b\}^* \mid w \textrm{ enthält mindestens ein $a$ und ein $b$}\}\]
\end{enumerate}
\subsubsection{\textbf{Aufgabe 3}}
\label{sec:org0ea033e}

Gegeben ist folgender Automat: \\
\[\begin{aligned}
        A=(&\{s_0, s_1, s_2, s_3, s_4\}, \{0,1\}, \delta, s_0, \{s_3, s_4\})\\
        \delta=\{&(s_0,0,s_1),(s_0,1,s_2),\\
                 &(s_1,0,s_2),(s_1,1,s_3),\\
                 &(s_2,0,s_1),(s_2,1,s_3),\\
                 &(s_3,0,s_1),(s_3,1,s_4),\\
                 &(s_4,0,s_2),(s_4,1,s_4)\}\\
\end{aligned}\]

Ermitteln Sie zu \(A\) den Minimalautomaten!
\subsubsection{\textbf{Aufgabe 4}}
\label{sec:org9b1ba25}

Zeigen Sie, dass die Sprache \[L=\{a^ib^k \mid k > i\}\] nicht regulär
ist.
\subsubsection{\textbf{Aufgabe 5}}
\label{sec:orgef7b14c}

Geben Sie die folgende Grammatik in der Chomsky-Normalform an: \\

\[\begin{aligned}
        S \rightarrow & a \mid bA\\
        A \rightarrow & AB \mid bDA \mid B\\
        B \rightarrow & a \mid b \mid bDE\\
        C \rightarrow & AAA \mid \varepsilon\\  
        D \rightarrow & bAC 
\end{aligned}\]
\subsubsection{\textbf{Aufgabe 6}}
\label{sec:org0dad556}

Gegeben sei die Grammatik \(G=(\{S, A, B, C, D\}, \{a, b, c\}, S, P)\)
mit: \\

\[\begin{aligned}
        P=\{S\rightarrow & BB \mid AA,\\
        A\rightarrow & AD \mid AC \mid a,\\
        B\rightarrow & BA \mid CB \mid b,\\
        C\rightarrow & BC \mid c,\\
        D\rightarrow & AC \mid b\}  
\end{aligned}\]

Prüfen Sie mit dem CYK-Algorithmus, ob das Wort \(babcba\) in \(L(G)\) enthalten ist.
\subsubsection{\textbf{Aufgabe 7}}
\label{sec:org0d411be}

Gegeben ist folgende Sprache:

\[L=\{w \in \{a,b\}^* \mid |w|_a=|w|_b\}\]

\begin{enumerate}
\item Konstruieren Sie einen deterministischen Kellerautomaten, der diese
Sprache akzeptiert.

\item Kann man auch einen DPDA konstruieren, der die Sprache mittels leerem
Keller akzeptiert?
\end{enumerate}
\subsubsection{\textbf{Aufgabe 8}}
\label{sec:orgb6eb36c}

Konstruieren Sie eine 1-Band-Turingmaschine, die eine Multiplikation
natürlicher Zahlen berechnet. Die Eingabe soll dabei in
Bierdeckelnotation erfolgen. Als Beispiel sei die Rechnung \(3\cdot2\)
genannt. Auf dem Band steht dann zu Beginn: \texttt{\#|||}\(\cdot\)=||\#=

Nach der Abarbeitung durch die TM soll auf dem Band das Ergebnis stehen,
hier also die Zahl \(6\) bzw. \texttt{\#||||||\#}
\end{document}
